---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ShapeImporter
source: html/7a5084cb-05ab-0952-d839-ccf6eb18aacc.htm
---
# ShapeImporter Members

Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).